Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.0.31/Microchip.SAML10_DFP.pdsc
      <condition id="ATSAML10D14A">
         <require Dvendor="Microchip:3" Dname="ATSAML10D14A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML10D16A">
         <require Dvendor="Microchip:3" Dname="ATSAML10D16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML10E15A">
         <require Dvendor="Microchip:3" Dname="ATSAML10E15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML10E16A">
         <require Dvendor="Microchip:3" Dname="ATSAML10E16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAML10D15A">
         <description>Headers and startup code for Microchip ATSAML10D15A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml10d15a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml10d15a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml10d15a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml10d15a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml10d15a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml10d15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml10d15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml10d15a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml10d15a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml10d15a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAML10E14A">
         <description>Headers and startup code for Microchip ATSAML10E14A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml10e14a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml10e14a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml10e14a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml10e14a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml10e14a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml10e14a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml10e14a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml10e14a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml10e14a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml10e14a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAML10D14A">
         <description>Headers and startup code for Microchip ATSAML10D14A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml10d14a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml10d14a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml10d14a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml10d14a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml10d14a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml10d14a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml10d14a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml10d14a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml10d14a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml10d14a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAML10D16A">
         <description>Headers and startup code for Microchip ATSAML10D16A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml10d16a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml10d16a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml10d16a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml10d16a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml10d16a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml10d16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml10d16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml10d16a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml10d16a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml10d16a/flash.icf" attr="config"/>
         </files>
      </component>
